In [1]:
#Import the libraries
import numpy as np
import pandas as pd
from pandas import *

## Reading & Writing text files

In [2]:
#new df using the read_csv function 
txt_df=pd.read_csv('sample_txt.csv')

In [3]:
txt_df

    2   5   7   infant
0  13  76   8      old
1   9  55  21  newborn
2  45  66  82  toddler

### Set the first row calues as column names

In [6]:
#new df using the read_csv function 
txt_df=pd.read_csv('sample_txt.csv',header=None)

In [7]:
txt_df

    0   1   2        3
0   2   5   7   infant
1  13  76   8      old
2   9  55  21  newborn
3  45  66  82  toddler

### In case of other delimiters

In [11]:
#Use read_table function and declare the seperator
txt_df=pd.read_table('sample_txt.csv',sep=",",header=None)

In [12]:
txt_df

    0   1   2        3
0   2   5   7   infant
1  13  76   8      old
2   9  55  21  newborn
3  45  66  82  toddler

### Read only specific number of rows

In [4]:
#declare the nrows parameter
pd.read_csv('sample_txt.csv',header=None,nrows=2)

    0   1  2       3
0   2   5  7  infant
1  13  76  8     old

## Write to dataframe to other location

In [14]:
#dataframe to csv file
txt_df.to_csv('first_df.csv')

In [15]:
#Read the new df
first_df=pd.read_csv('first_df.csv')
#View the content of df
first_df

   Unnamed: 0   0   1   2        3
0           0   2   5   7   infant
1           1  13  76   8      old
2           2   9  55  21  newborn
3           3  45  66  82  toddler

## Write a file using other delimiter

In [16]:
#import sys
import sys
#write file using _ as seperator
txt_df.to_csv(sys.stdout,sep="_")

_0_1_2_3
0_2_5_7_infant
1_13_76_8_old
2_9_55_21_newborn
3_45_66_82_toddler

In [18]:
#write file using | as seperator
txt_df.to_csv(sys.stdout,sep="|")

|0|1|2|3
0|2|5|7|infant
1|13|76|8|old
2|9|55|21|newborn
3|45|66|82|toddler

In [20]:
## Write only few columns of df
txt_df.to_csv(sys.stdout,columns=[0,1,2],sep="|")

|0|1|2
0|2|5|7
1|13|76|8
2|9|55|21
3|45|66|82

## Dealing with  JSON objects

In [32]:
json_obj="""
{   "name":"John",
    "age":30,
    "cars": [
        { "name":"Ford", "models":[ "Fiesta", "Focus", "Mustang" ] },
        { "name":"BMW", "models":[ "320", "X3", "X5" ] },
        { "name":"Fiat", "models":[ "500", "Panda" ] }
    ]
 }
 """

In [33]:
import json

In [34]:
#Read the json object using loads function
json_df=json.loads(json_obj)

In [35]:
#View the new df
json_df

{u'age': 30,
 u'cars': [{u'models': [u'Fiesta', u'Focus', u'Mustang'], u'name': u'Ford'},
  {u'models': [u'320', u'X3', u'X5'], u'name': u'BMW'},
  {u'models': [u'500', u'Panda'], u'name': u'Fiat'}],
 u'name': u'John'}

In [36]:
#Convert back to json object
json.dumps(json_df)

'{"cars": [{"models": ["Fiesta", "Focus", "Mustang"], "name": "Ford"}, {"models": ["320", "X3", "X5"], "name": "BMW"}, {"models": ["500", "Panda"], "name": "Fiat"}], "age": 30, "name": "John"}'

In [37]:
# create dataframe from section of json object
df_json_obj=pd.DataFrame(json_df['cars'])

In [38]:
#view the new df
df_json_obj

                     models  name
0  [Fiesta, Focus, Mustang]  Ford
1             [320, X3, X5]   BMW
2              [500, Panda]  Fiat

## Dealing with HTML

In [16]:
from pandas import read_html
!pip install lxml
import lxml
#!pip install beautifulsoup
#!pip install html5lib

Requirement already satisfied: lxml in /opt/conda/lib/python3.6/site-packages

In [17]:
url='http://stats.espncricinfo.com/ci/content/records/210099.html'

In [19]:
#create a list of df objects  using read_html  
url_df=pd.io.html.read_html(url,flavor='html5lib')

In [20]:
#Pick first object from list of dataframe objects
final_url_df=url_df[0]
final_url_df

,Winner,Margin,Opposition,Ground,Match Date,Scorecard
0,England,inns & 579 runs,v Australia,The Oval,20 Aug 1938,Test # 266
1,Australia,inns & 360 runs,v South Africa,Johannesburg,22 Feb 2002,Test # 1590
2,West Indies,inns & 336 runs,v India,Kolkata,31 Dec 1958,Test # 463
3,Australia,inns & 332 runs,v England,Brisbane,29 Nov 1946,Test # 279
4,Pakistan,inns & 324 runs,v New Zealand,Lahore,1 May 2002,Test # 1600
5,West Indies,inns & 322 runs,v New Zealand,Wellington,10 Feb 1995,Test # 1289
6,West Indies,inns & 310 runs,v Bangladesh,Dhaka,8 Dec 2002,Test # 1630
7,New Zealand,inns & 301 runs,v Zimbabwe,Napier,26 Jan 2012,Test # 2033
8,New Zealand,inns & 294 runs,v Zimbabwe,Harare,7 Aug 2005,Test # 1759
9,England,inns & 285 runs,v India,Lord's,20 Jun 1974,Test # 740
10,England,inns & 283 runs,v West Indies,Leeds,25 May 2007,Test # 1834
11,Pakistan,inns & 264 runs,v Bangladesh,Multan,29 Aug 2001,Test # 1560
12,England,inns & 261 runs,v Bangladesh,Lord's,26 May 2005,Test # 1751
13,Australia,inns & 259 runs,v South Africa,Port Elizabeth,3 Mar 1950,Test # 322
14,Sri Lanka,inns & 254 runs,v Zimbabwe,Bulawayo,14 May 2004,Test # 1699
15,South Africa,inns & 254 runs,v Bangladesh,Bloemfontein,6 Oct 2017,Test # 2277
16,Sri Lanka,inns & 248 runs,v Bangladesh,Dhaka,27 Jan 2014,Test # 2116
17,England,inns & 244 runs,v India,The Oval,15 Aug 2014,Test # 2137
18,England,inns & 242 runs,v India,Birmingham,10 Aug 2011,Test # 2003
19,Sri Lanka,inns & 240 runs,v Zimbabwe,Harare,6 May 2004,Test # 1698
20,India,inns & 239 runs,v Bangladesh,Dhaka,25 May 2007,Test # 1833
21,Sri Lanka,inns & 239 runs,v India,Colombo (SSC),23 Jul 2008,Test # 1882
22,India,inns & 239 runs,v Sri Lanka,Nagpur,24 Nov 2017,Test # 2283
23,England,inns & 237 runs,v West Indies,The Oval,22 Aug 1957,Test # 443
24,Sri Lanka,inns & 234 runs,v Bangladesh,Colombo (SSC),25 Jun 2007,Test # 1837
25,England,inns & 230 runs,v Australia,Adelaide,24 Mar 1892,Test # 38
26,South Africa,inns & 229 runs,v Sri Lanka,Cape Town,2 Jan 2001,Test # 1528
27,Australia,inns & 226 runs,v India,Brisbane,28 Nov 1947,Test # 290
28,West Indies,inns & 226 runs,v England,Lord's,23 Aug 1973,Test # 727
29,England,inns & 225 runs,v Australia,Melbourne,9 Feb 1912,Test # 119
30,England,inns & 225 runs,v Pakistan,Lord's,26 Aug 2010,Test # 1971
31,Australia,inns & 222 runs,v New Zealand,Hobart,26 Nov 1993,Test # 1236
32,South Africa,inns & 220 runs,v West Indies,Centurion,17 Dec 2014,Test # 2150
33,India,inns & 219 runs,v Australia,Kolkata,18 Mar 1998,Test # 1409
34,South Africa,inns & 219 runs,v Zimbabwe,Harare,11 Nov 1999,Test # 1468
35,England,inns & 217 runs,v Australia,The Oval,12 Aug 1886,Test # 24
36,Australia,inns & 217 runs,v West Indies,Brisbane,16 Jan 1931,Test # 203
37,England,inns & 215 runs,v New Zealand,Auckland,23 Feb 1963,Test # 540
38,Sri Lanka,inns & 215 runs,v England,Colombo (SSC),18 Dec 2003,Test # 1675
39,Australia,inns & 212 runs,v West Indies,Hobart,10 Dec 2015,Test # 2193
40,England,inns & 209 runs,v Zimbabwe,Lord's,18 May 2000,Test # 1495
41,England,inns & 209 runs,v West Indies,Birmingham,17 Aug 2017,Test # 2270
42,South Africa,inns & 208 runs,v Sri Lanka,Colombo (SSC),6 Sep 1993,Test # 1233
43,England,inns & 207 runs,v India,Manchester,17 Jul 1952,Test # 353
44,South Africa,inns & 205 runs,v Bangladesh,Chittagong,29 Feb 2008,Test # 1865
45,England,inns & 202 runs,v South Africa,Cape Town,25 Mar 1889,Test # 32
46,Australia,inns & 201 runs,v Sri Lanka,Melbourne,26 Dec 2012,Test # 2068
47,Australia,inns & 200 runs,v England,Melbourne,26 Feb 1937,Test # 259

## Dataframe operations on new df

In [59]:
#View the columns of df
final_url_df.columns

array([u'Winner', u'Margin', u'Opposition', u'Ground', u'Match Date',
       u'Scorecard'], dtype=object)

In [60]:
#Validate number of rows & columns
final_url_df.shape

(48, 6)

In [61]:
#Top rows of df
final_url_df.head(3)

,Winner,Margin,Opposition,Ground,Match Date,Scorecard
0,England,inns & 579 runs,v Australia,The Oval,20 Aug 1938,Test # 266
1,Australia,inns & 360 runs,v South Africa,Johannesburg,22 Feb 2002,Test # 1590
2,West Indies,inns & 336 runs,v India,Kolkata,31 Dec 1958,Test # 463

## Dealing with excel files

In [70]:
#!pip install xlrd
#!pip install openpyxl

In [72]:
#create excel object
xl_file=pd.ExcelFile('sample_xl.xlsx')
#create dataframe using sheet from object
df_xl=xl_file.parse('Sheet1')

In [73]:
#View the dataframe
df_xl

   test  col1  col2  col3
0     1     3    55    10
1     2     4    66    20
2     3     5     7    30

# Kool :)